sketchup-backend/app/controllers/authentication_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "Bibi"], ["LIMIT", 1]]
---
    def login
        # check to see if the username is in our date base
        # AND if the user password is correct
        user = User.find_by({ username: params[:username]})

SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "George"], ["LIMIT", 1]]
INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)
---
    def signUp
        # byebug
        if(!User.find_by({ username: params[:username]}))
            # byebug
            user = User.create({
                username: params[:username],
                password: params[:password]
            })