sketchup-backend/app/controllers/images_controller.rb

SELECT "images".* FROM "images"
---
    def index
        images = Image.all